eicheltechgames/zflight/drivers/esc/dshot/dshot_stm32.c
/*
 * Copyright (c) 2024 Arthur Eichelberger
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_dshot

#include <errno.h>

#include <stm32_ll_tim.h>
#include <stm32_ll_rcc.h>
#include <zflight/drivers/esc.h>
#include <zflight/drivers/esc/dshot.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#ifdef CONFIG_DCACHE
#include <zephyr/dt-bindings/memory-attr/memory-attr-arm.h>
#endif /* CONFIG_DCACHE */
#ifdef CONFIG_NOCACHE_MEMORY
#include <zephyr/linker/linker-defs.h>
#elif defined(CONFIG_CACHE_MANAGEMENT)
#include <zephyr/arch/cache.h>
#endif /* CONFIG_NOCACHE_MEMORY */

#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>

#include "dshot_common.h"

#include <zephyr/logging/log.h>

LOG_MODULE_REGISTER(dshot_stm32, CONFIG_DSHOT_LOG_LEVEL);

/* L0 series MCUs only have 16-bit timers and don't have below macro defined */
#ifndef IS_TIM_32B_COUNTER_INSTANCE
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (0)
#endif

/** Maximum number of timer channels : only 4 supported */
#define TIMER_MAX_CH    4u

#if defined(CONFIG_DCACHE) &&                               \
    !defined(CONFIG_NOCACHE_MEMORY)
/* currently, manual cache coherency management is only done on dummy_rx_tx_buffer */
#define DSHOT_STM32_MANUAL_CACHE_COHERENCY_REQUIRED	1
#else
#define  DSHOT_STM32_MANUAL_CACHE_COHERENCY_REQUIRED	0
#endif /* defined(CONFIG_DCACHE) && !defined(CONFIG_NOCACHE_MEMORY) */

#define DSHOT_STM32_DMA_TIM_BUF_SIZE        (DSHOT_TIM_BUF_LEN * sizeof(uint32_t))
#define DSHOT_STM32_DMA_BURST_TIM_BUF_LEN   (DSHOT_TIM_BUF_LEN * TIMER_MAX_CH)
#define DSHOT_STM32_DMA_BURST_TIM_BUF_SIZE  (DSHOT_STM32_DMA_BURST_TIM_BUF_LEN * sizeof(uint32_t))

enum dshot_stm32_dir {
    INPUT_DIR = 0b01,
    OUTPUT_DIR = 0b10,
    ANY_DIR = 0b11,
};

struct dshot_active_command {
    enum dshot_command command;
    uint16_t repeat;
    uint16_t delay_ms;
};

/** DShot DMA */
struct dshot_stm32_dma {
    const struct device *dev;
    const uint32_t channel;
    struct dma_config config;
    struct dma_block_config block;
};

/** DShot channel data. */
struct dshot_stm32_channel_data {
#ifdef CONFIG_DSHOT_BIDIR
    LL_TIM_OC_InitTypeDef oc_init;
#endif
    bool pending_telem_req;
    struct dshot_active_command active_cmd;
    struct dshot_stm32_dma dma;
    uint32_t *tim_buf;
};

/** DShot data. */
struct dshot_stm32_data {
#ifdef CONFIG_DSHOT_BIDIR
    LL_TIM_IC_InitTypeDef ic_init;
    enum dshot_stm32_dir curr_dir;
#endif
    bool enabled;
    uint32_t last_send_timestamp;
#ifdef DSHOT_STM32_DMA_BURST
    struct dshot_stm32_dma burst_dma;
    uint32_t *burst_tim_buf;
#endif
    struct dshot_stm32_channel_data *channels[TIMER_MAX_CH];
};

/** DShot channel config. */
struct dshot_stm32_channel_config {
    uint32_t ll_channel;
    bool inverted;
};

/** DShot configuration. */
struct dshot_stm32_config {
    TIM_TypeDef *timer;
    struct stm32_pclken pclken;
    const struct reset_dt_spec reset;
    const struct pinctrl_dev_config *pcfg;
    enum dshot_type default_type;
#ifdef DSHOT_STM32_DMA_BURST
    bool use_dma_burst;
#endif
    const struct dshot_stm32_channel_config *channels[TIMER_MAX_CH];
};

static inline bool is_complementary_channel(uint32_t ll_channel)
{
    switch (ll_channel)
    {
    case LL_TIM_CHANNEL_CH1N:
    case LL_TIM_CHANNEL_CH2N:
    case LL_TIM_CHANNEL_CH3N:
#if defined(LL_TIM_CHANNEL_CH4N)
    case LL_TIM_CHANNEL_CH4N:
#endif
        return true;
    default:
        return false;
    }
}

static inline uint32_t positive_channel(uint32_t ll_channel)
{
    switch (ll_channel)
    {
    case LL_TIM_CHANNEL_CH1N:
        return LL_TIM_CHANNEL_CH1;
    case LL_TIM_CHANNEL_CH2N:
        return LL_TIM_CHANNEL_CH2;
    case LL_TIM_CHANNEL_CH3N:
        return LL_TIM_CHANNEL_CH3;
#if defined(LL_TIM_CHANNEL_CH4N)
    case LL_TIM_CHANNEL_CH4N:
        return LL_TIM_CHANNEL_CH4;
#endif
    default:
        return ll_channel;
    }
}

/* Function mapping: ch_idx to LL_TIM_EnableDMAReq_CCx */
static void __maybe_unused (*const LL_TIM_EnableDMAReq_CC[])(TIM_TypeDef *) = {
    LL_TIM_EnableDMAReq_CC1, LL_TIM_EnableDMAReq_CC2,
    LL_TIM_EnableDMAReq_CC3, LL_TIM_EnableDMAReq_CC4,
};

/* Function mapping: ch_idx to LL_TIM_EnableDMAReq_CCx */
static void __maybe_unused (*const LL_TIM_DisableDMAReq_CC[])(TIM_TypeDef *) = {
    LL_TIM_DisableDMAReq_CC1, LL_TIM_DisableDMAReq_CC2,
    LL_TIM_DisableDMAReq_CC3, LL_TIM_DisableDMAReq_CC4,
};

static inline bool get_tim_busy(const struct device *dev)
{
    const struct dshot_stm32_config *cfg = dev->config;
    return LL_TIM_IsEnabledCounter(cfg->timer);
}

static inline int get_channel_data(struct dshot_stm32_data *data,
    uint32_t channel, struct dshot_stm32_channel_data** out_ch_data)
{
    if (channel < 1u || channel > TIMER_MAX_CH) {
        LOG_ERR("Channel %d out of bounds", channel);
        return -EINVAL;
    }
    *out_ch_data = data->channels[channel - 1u];

    if (*out_ch_data == NULL) {
        LOG_ERR("Channel %d was not configured", channel);
        return -EINVAL;
    }
    return 0;
}

static inline int get_channel_config(const struct dshot_stm32_config *cfg,
    uint32_t channel, const struct dshot_stm32_channel_config** out_ch_cfg)
{
    if (channel < 1u || channel > TIMER_MAX_CH) {
        LOG_ERR("Channel %d out of bounds", channel);
        return -EINVAL;
    }
    *out_ch_cfg = cfg->channels[channel - 1u];

    if (*out_ch_cfg == NULL) {
        LOG_ERR("Channel %d was not configured", channel);
        return -EINVAL;
    }
    return 0;
}

/**
 * Obtain timer clock speed.
 *
 * @param pclken  Timer clock control subsystem.
 * @param tim_clk Where computed timer clock will be stored.
 *
 * @return 0 on success, error code otherwise.
 */
static inline int get_tim_clk(const struct stm32_pclken *pclken, uint32_t *tim_clk)
{
    int r;
    const struct device *clk;
    uint32_t bus_clk, apb_psc;

    clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

