eicheltechgames/zflight/drivers/esc/dshot/dshot_stm32.c
    r = clock_control_get_rate(clk, (clock_control_subsys_t)pclken,
                   &bus_clk);
    if (r < 0) {
        return r;
    }

#if defined(CONFIG_SOC_SERIES_STM32H7X)
    if (pclken->bus == STM32_CLOCK_BUS_APB1) {
        apb_psc = STM32_D2PPRE1;
    } else {
        apb_psc = STM32_D2PPRE2;
    }
#else
    if (pclken->bus == STM32_CLOCK_BUS_APB1) {
#if defined(CONFIG_SOC_SERIES_STM32MP1X)
        apb_psc = (uint32_t)(READ_BIT(RCC->APB1DIVR, RCC_APB1DIVR_APB1DIV));
#else
        apb_psc = STM32_APB1_PRESCALER;
#endif
    }
#if !defined(CONFIG_SOC_SERIES_STM32C0X) && !defined(CONFIG_SOC_SERIES_STM32F0X) && \
    !defined(CONFIG_SOC_SERIES_STM32G0X)
    else {
#if defined(CONFIG_SOC_SERIES_STM32MP1X)
        apb_psc = (uint32_t)(READ_BIT(RCC->APB2DIVR, RCC_APB2DIVR_APB2DIV));
#else
        apb_psc = STM32_APB2_PRESCALER;
#endif
    }
#endif
#endif

#if defined(RCC_DCKCFGR_TIMPRE) || defined(RCC_DCKCFGR1_TIMPRE) || \
    defined(RCC_CFGR_TIMPRE)
    /*
     * There are certain series (some F4, F7 and H7) that have the TIMPRE
     * bit to control the clock frequency of all the timers connected to
     * APB1 and APB2 domains.
     *
     * Up to a certain threshold value of APB{1,2} prescaler, timer clock
     * equals to HCLK. This threshold value depends on TIMPRE setting
     * (2 if TIMPRE=0, 4 if TIMPRE=1). Above threshold, timer clock is set
     * to a multiple of the APB domain clock PCLK{1,2} (2 if TIMPRE=0, 4 if
     * TIMPRE=1).
     */

    if (LL_RCC_GetTIMPrescaler() == LL_RCC_TIM_PRESCALER_TWICE) {
        /* TIMPRE = 0 */
        if (apb_psc <= 2u) {
            LL_RCC_ClocksTypeDef clocks;

            LL_RCC_GetSystemClocksFreq(&clocks);
            *tim_clk = clocks.HCLK_Frequency;
        } else {
            *tim_clk = bus_clk * 2u;
        }
    } else {
        /* TIMPRE = 1 */
        if (apb_psc <= 4u) {
            LL_RCC_ClocksTypeDef clocks;

            LL_RCC_GetSystemClocksFreq(&clocks);
            *tim_clk = clocks.HCLK_Frequency;
        } else {
            *tim_clk = bus_clk * 4u;
        }
    }
#else
    /*
     * If the APB prescaler equals 1, the timer clock frequencies
     * are set to the same frequency as that of the APB domain.
     * Otherwise, they are set to twice (×2) the frequency of the
     * APB domain.
     */
    if (apb_psc == 1u) {
        *tim_clk = bus_clk;
    } else {
        *tim_clk = bus_clk * 2u;
    }
#endif

    return 0;
}

static void dshot_stm32_set_direction_output(const struct device *dev)
{
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;

#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    if (!cfg->use_burst_dma) {
#endif
        for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
            const struct dshot_stm32_channel_config *ch_cfg =
                cfg->channels[ch_idx];
            struct dshot_stm32_channel_data *ch_data =
                data->channels[ch_idx];

            if (ch_cfg == NULL || ch_data == NULL) {
                continue;
            }

            LL_TIM_DisableDMAReq_CC[ch_idx](cfg->timer);

            struct dshot_stm32_dma *ch_dma = &ch_data->dma;
            dma_stop(ch_dma->dev, ch_dma->channel);
            ch_dma->block.source_address = (uint32_t)&ch_data->tim_buf[0];
            ch_dma->block.dest_address = (uint32_t)&cfg->timer->DMAR;
            ch_dma->block.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
            ch_dma->block.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
            ch_dma->config.channel_direction = MEMORY_TO_PERIPHERAL;
            dma_config(ch_dma->dev, ch_dma->channel, &ch_dma->config);

#ifdef CONFIG_DSHOT_BIDIR
            const uint32_t channel = positive_channel(ch_cfg->ll_channel);
            LL_TIM_OC_DisablePreload(cfg->timer, channel);
            LL_TIM_OC_Init(cfg->timer, channel, ch_data->oc_init);
            LL_TIM_OC_EnablePreload(cfg->timer, channel);
#endif

            LL_TIM_EnableDMAReq_CC[ch_idx](cfg->timer);
        }
#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    } else {
        LL_TIM_DisableDMAReq_UPDATE(cfg->timer);

        struct dshot_stm32_dma *burst_dma = &data->burst_dma;
        dma_stop(burst_dma->dev, burst_dma->channel);
        dma_config(burst_dma->dev, burst_dma->channel, burst_dma->config);

        LL_TIM_EnableDMAReq_UPDATE(cfg->timer);
    }
#endif

#ifdef CONFIG_DSHOT_BIDIR
    data->curr_dir = OUTPUT_DIR;
#endif
}

#ifdef CONFIG_DSHOT_BIDIR
static void dshot_stm32_set_direction_input(const struct device *dev)
{
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;

    if (IS_TIM_32B_COUNTER_INSTANCE(cfg->timer)) {
        LL_TIM_SetAutoReload(cfg->timer, UINT32_MAX);
    } else {
        LL_TIM_SetAutoReload(cfg->timer, UINT16_MAX);
    }

    for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
        const struct dshot_stm32_channel_config *ch_cfg =
            cfg->channel_config[ch_idx];
        struct dshot_stm32_channel_data *ch_data =
            data->channel_data[ch_idx];

        if (ch_cfg == NULL || ch_data == NULL) {
            continue;
        }

        LL_TIM_DisableDMAReq_CC[ch_idx](cfg->timer);

        struct dshot_stm32_dma *ch_dma = &ch_data->dma;
        dma_stop(ch_dma->dev, ch_dma->channel);
        ch_dma->block.source_address = (uint32_t)&cfg->timer->DMAR;
        ch_dma->block.dest_address = (uint32_t)&ch_data->tim_buf[0];
        ch_dma->block.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
        ch_dma->block.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
        ch_dma->config.channel_direction = PERIPHERAL_TO_MEMORY;
        dma_config(ch_dma->dev, ch_dma->channel, &ch_dma->config);

        const uint32_t channel = positive_channel(ch_cfg->ll_channel);
        LL_TIM_IC_Init(cfg->timer, channel, data->ic_init);

        LL_TIM_EnableDMAReq_CC[ch_idx](cfg->timer);
    }

    data->curr_dir = INPUT_DIR;
}
#endif

static enum esc_type dshot_stm32_get_esc_type(const struct device *dev)
{
    ARG_UNUSED(dev);
    return ESC_TYPE_DSHOT;
}

