eicheltechgames/zflight/drivers/esc/dshot/dshot_stm32.c
static enum dshot_type dshot_stm32_get_type(const struct device *dev)
{
    const struct dshot_stm32_config *cfg = dev->config;
    uint32_t tim_clk;

    get_tim_clk(&cfg->pclken, &tim_clk);
    const uint16_t prescaler = LL_TIM_GetPrescaler(cfg->timer) + 1;
    const uint32_t dshot = (tim_clk / prescaler) / DSHOT_TIM_CNTS_PER_BIT;
    return dshot / KHZ(1);
}

static int dshot_stm32_set_type(const struct device *dev, enum dshot_type type)
{
    const struct dshot_stm32_config *cfg = dev->config;
    uint32_t tim_clk;
    int err = 0;

    if (get_tim_busy(dev)) {
        return -EBUSY;
    }

    err = get_tim_clk(&cfg->pclken, &tim_clk);
    if (err) {
        LOG_ERR("Could not obtain timer clock (%d)", err);
        return err;
    }

    const uint16_t prescaler = tim_clk / DSHOT_TIM_CNTS_PER_BIT * DSHOT_BIT_RATE(type);
    const uint16_t rem = tim_clk % DSHOT_TIM_CNTS_PER_BIT * DSHOT_BIT_RATE(type);
    if (rem) {
        LOG_ERR("Timer clock not configured for dshot (%d)", tim_clk);
        return -EIO;
    }

    LL_TIM_SetPrescaler(cfg->timer, prescaler - 1);
    LL_TIM_GenerateEvent_UPDATE(cfg->timer);
    return 0;
}

static enum dshot_mode dshot_stm32_get_mode(const struct device *dev)
{
#ifndef CONFIG_DSHOT_BIDIR
    ARG_UNUSED(dev);
#else
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;

    for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
        const struct dshot_stm32_channel_config *ch_cfg =
            cfg->channel_config[ch_idx];
        struct dshot_stm32_channel_data *ch_data =
            data->channel_data[ch_idx];

        if (ch_cfg == NULL || ch_data == NULL) {
            continue;
        }


        if (is_complementary_channel(ch_cfg->ll_channel) || ch_cfg->inverted) {
            return ch_data->oc_init.OCPolarity == LL_TIM_OCPOLARITY_HIGH ?
                DSHOT_MODE_NORMAL : DSHOT_MODE_BIDIRECTIONAL;
        } else {
            return ch_data->oc_init.OCNPolarity == LL_TIM_OCPOLARITY_HIGH ?
                DSHOT_MODE_NORMAL : DSHOT_MODE_BIDIRECTIONAL;
        }
    }
#endif
    return DSHOT_MODE_NORMAL;
}

static inline void set_mode_oc_init_internal(const struct dshot_stm32_channel_config *ch_cfg,
                                             enum dshot_mode mode,
                                             LL_TIM_OC_InitTypeDef *oc_init)
{
    bool polarity_high = (mode == DSHOT_MODE_NORMAL) != ch_cfg->inverted;
    uint32_t polarity = polarity_high ? LL_TIM_OCPOLARITY_HIGH : LL_TIM_OCPOLARITY_LOW;
    uint32_t idleState = polarity_high ? LL_TIM_OCIDLESTATE_LOW : LL_TIM_OCIDLESTATE_HIGH;

    if (is_complementary_channel(ch_cfg->ll_channel)) {
        oc_init->OCNPolarity = polarity;
        oc_init->OCNIdleState = idleState;
    } else {
        oc_init->OCPolarity = polarity;
        oc_init->OCIdleState = idleState;
    }
}

#ifdef CONFIG_DSHOT_BIDIR
static int dshot_stm32_set_mode(const struct device *dev, enum dshot_mode mode)
{
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;

    if (get_tim_busy(dev, ANY_DIR)) {
        return -EBUSY;
    }

    for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
        const struct dshot_stm32_channel_config *ch_cfg =
            cfg->channel_config[ch_idx];
        struct dshot_stm32_channel_data *ch_data =
            data->channel_data[ch_idx];

        if (ch_cfg == NULL || ch_data == NULL) {
            continue;
        }

        set_mode_oc_init_internal(ch_cfg, mode, &ch_data->oc_init);
    }
    return 0;
}
#endif

static bool dshot_stm32_get_enabled(const struct device *dev)
{
    struct dshot_stm32_data *data = dev->data;
    return data->enabled;
}

static int dshot_stm32_set_enabled(const struct device *dev, bool enabled)
{
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;

    for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
        const struct dshot_stm32_channel_config *ch_cfg =
            cfg->channels[ch_idx];

        if (ch_cfg == NULL) {
            continue;
        }

        if (enabled) {
            LL_TIM_CC_EnableChannel(cfg->timer, ch_cfg->ll_channel);
        } else {
            LL_TIM_CC_DisableChannel(cfg->timer, ch_cfg->ll_channel);
        }
    }

    data->enabled = enabled;
    return 0;
}

static int dshot_stm32_set_packet(const struct device *dev, uint32_t channel, uint16_t payload)
{
    struct dshot_stm32_data *data = dev->data;
    struct dshot_stm32_channel_data *ch_data;
    int err;

    err = get_channel_data(data, channel, &ch_data);
    if (err) {
        return err;
    }

    if (get_tim_busy(dev)) {
        return -EBUSY;
    }

    uint16_t packet = dshot_common_make_packet(payload,
                        ch_data->pending_telem_req,
                        dshot_stm32_get_mode(dev) == DSHOT_MODE_BIDIRECTIONAL);
    ch_data->pending_telem_req = false;

#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    if (!cfg->use_burst_dma) {
#endif
        dshot_common_load_dshot_buffer(&ch_data->tim_buf[0], 1, packet);
#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    } else {
        dshot_common_load_dshot_buffer(&data->burst_tim_buf[channel - 1u], TIMER_MAX_CH, packet);
    }
#endif
    return 0;
}

static int dshot_stm32_set_throttle(const struct device *dev, uint32_t channel, uint16_t throttle)
{
    static const struct dshot_active_command reset = { 0 };

    int err = dshot_stm32_set_packet(dev, channel, dshot_common_quantize_throttle(throttle));

    if (!err) {
        // ch_data validated in dshot_stm32_set_packet
        struct dshot_stm32_data *data = dev->data;
        struct dshot_stm32_channel_data *ch_data = data->channels[channel - 1u];
        ch_data->active_cmd = reset;
    }
    return err;
}

static int dshot_stm32_set_command(const struct device *dev, uint32_t channel, enum dshot_command command)
{
    int err = dshot_stm32_set_packet(dev, channel, (uint16_t)command);

    if (!err) {
        // ch_data validated in dshot_stm32_set_packet
        struct dshot_stm32_data *data = dev->data;
        struct dshot_stm32_channel_data *ch_data = data->channels[channel - 1u];
        struct dshot_active_command new_cmd = {
            .command = command,
            .repeat = command_settings[command].repeat,
            .delay_ms = command_settings[command].delay_ms,
        };
        ch_data->active_cmd = new_cmd;
    }
    return err;
}

static int dshot_stm32_set_request_telem(const struct device *dev, uint32_t channel)
{
    struct dshot_stm32_data *data = dev->data;
    struct dshot_stm32_channel_data *ch_data;

    int err = get_channel_data(data, channel, &ch_data);
    if (err) {
        return err;
    }

    ch_data->pending_telem_req = true;
    return 0;
}

static int dshot_stm32_send(const struct device *dev)
{
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;

    if (get_tim_busy(dev)) {
        return -EBUSY;
    }

    uint32_t curr_timestamp = k_uptime_get_32();
    for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
        const struct dshot_stm32_channel_config *ch_cfg =
            cfg->channels[ch_idx];
        struct dshot_stm32_channel_data *ch_data =
            data->channels[ch_idx];

        if (ch_cfg == NULL || ch_data == NULL) {
            continue;
        }

        if (ch_data->active_cmd.repeat > 0) {
            ch_data->active_cmd.repeat--;
        } else if (ch_data->active_cmd.delay_ms > 0) {
            int32_t delta = ch_data->active_cmd.delay_ms
                - (curr_timestamp - data->last_send_timestamp);
            ch_data->active_cmd.delay_ms = MAX(delta, 0);
            // disable the channel so other channels can still operate
            LL_TIM_CC_DisableChannel(cfg->timer, ch_cfg->ll_channel);
        } else {
            // re-enable the channel if it was disabled for a command
            ch_data->active_cmd.command = 0;
            LL_TIM_CC_EnableChannel(cfg->timer, ch_cfg->ll_channel);
        }

