eicheltechgames/zflight/drivers/esc/dshot/dshot_stm32.c
#ifdef CONFIG_DSHOT_STM32_DMA_BURST
        if (!cfg->use_burst_dma)
#endif
        {
            struct dshot_stm32_dma *dma = &ch_data->dma;
#if DSHOT_STM32_MANUAL_CACHE_COHERENCY_REQUIRED
            arch_dcache_flush_range((void *)&ch_data->tim_buf, DSHOT_STM32_DMA_TIM_BUF_SIZE);
#endif
            dma_start(dma->dev, dma->channel);
        }
    }
    data->last_send_timestamp = curr_timestamp;

#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    if (cfg->use_burst_dma) {
        struct dshot_stm32_dma *burst_dma = &data->burst_dma;
#if DSHOT_STM32_MANUAL_CACHE_COHERENCY_REQUIRED
        arch_dcache_flush_range((void *)&data->burst_tim_buf, DSHOT_STM32_DMA_BURST_TIM_BUF_SIZE);
#endif
        dma_start(burst_dma->dev, burst_dma->channel);
    }
#endif

    LL_TIM_EnableCounter(cfg->timer);
    return 0;
}

static int dshot_stm32_command_in_progress(const struct device *dev, uint32_t channel)
{
    struct dshot_stm32_data *data = dev->data;
    struct dshot_stm32_channel_data *ch_data;
    int err = get_channel_data(data, channel, &ch_data);
    if (err) {
        return err;
    }

    return ch_data->active_cmd.command;
}

#ifdef CONFIG_DSHOT_BIDIR
static int dshot_stm32_stop_receive(const struct device *dev)
{
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;

#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    if (!cfg->use_burst_dma) {
#endif
        for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
            struct dshot_stm32_channel_data *ch_data =
                data->channels[ch_idx];

            if (ch_data == NULL) {
                continue;
            }

            struct dshot_stm32_dma *dma = &ch_data->dma;
            dma_stop(dma->dev, dma->channel);
#if DSHOT_STM32_MANUAL_CACHE_COHERENCY_REQUIRED
            arch_dcache_invd_range((void *)&ch_data->tim_buf, DSHOT_STM32_DMA_TIM_BUF_SIZE);
#endif
        }
#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    } else {
        struct dshot_stm32_dma *burst_dma = &data->burst_dma;
        dma_stop(burst_dma->dev, burst_dma->channel);
#if DSHOT_STM32_MANUAL_CACHE_COHERENCY_REQUIRED
        arch_dcache_invd_range((void *)&data->burst_tim_buf, DSHOT_STM32_DMA_BURST_TIM_BUF_SIZE);
#endif
    }
#endif

    LL_TIM_DisableCounter(cfg->timer);
    dshot_stm32_set_direction_output(dev);
    return 0;
}

static int dshot_stm32_decode_telem(const struct device *dev, uint32_t channel,
                                enum dshot_telem_type *out_type, uint16_t *out_value)
{
    const struct dshot_stm32_config *cfg = dev->config;
    struct dshot_stm32_data *data = dev->data;
    struct dshot_stm32_channel_data *ch_data;
    int err;

    if (get_tim_busy(dev)) {
        return -EBUSY;
    }

    uint32_t telem_raw = 0;
    err = dshot_common_unpack_telem_buffer(&ch_data->tim_buf[0], &telem_raw);
    if (err) {
        // @todo log warning, dump data
        return err;
    }

    return dshot_common_decode_telem(telem_raw, out_type, out_value);
}
#endif

static const struct dshot_driver_api dshot_stm32_driver_api = {
    .esc.get_type = dshot_stm32_get_esc_type,
    .esc.get_enabled = dshot_stm32_get_enabled,
    .esc.set_enabled = dshot_stm32_set_enabled,
    .esc.set_throttle = dshot_stm32_set_throttle,
    .esc.send = dshot_stm32_send,
    .get_type = dshot_stm32_get_type,
    .set_type = dshot_stm32_set_type,
    .get_mode = dshot_stm32_get_mode,
#ifdef CONFIG_DSHOT_BIDIR
    .set_mode = dshot_stm32_set_mode,
#endif
    .set_command = dshot_stm32_set_command,
    .command_in_progress = dshot_stm32_command_in_progress,
    .set_request_telem = dshot_stm32_set_request_telem,
#ifdef CONFIG_DSHOT_BIDIR
    .stop_receive = dshot_stm32_stop_receive,
    .decode_telem = dshot_stm32_decode_telem,
#endif
};

#ifdef CONFIG_DSHOT_BIDIR
static void dshot_stm32_dma_cb(const struct device *dma_dev, void *user_data,
                        uint32_t channel, int status)
{
    const struct device *dshot_dev = user_data;
    const struct dshot_stm32_config *cfg = dshot_dev->config;
    struct dshot_stm32_data *data = dshot_dev->data;

    if (status == DMA_STATUS_COMPLETE) {
        if (data->curr_dir == OUTPUT_DIR) {
            dshot_stm32_set_direction_input(dshot_dev);
            dma_start(dma_dev, channel);
            LL_TIM_SetCounter(cfg->timer, 0);
        } else {
            dshot_stm32_set_direction_output(dshot_dev);
        }
    } else {
        dshot_stm32_set_direction_output(dshot_dev);
    }
}
#endif

static int dshot_stm32_init(const struct device *dev)
{
    struct dshot_stm32_data *data = dev->data;
    const struct dshot_stm32_config *cfg = dev->config;

    int err;
    const struct device *clk;
    LL_TIM_InitTypeDef init;

    /* enable clock and store its speed */
    clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

    if (!device_is_ready(clk)) {
        LOG_ERR("clock control device not ready");
        return -ENODEV;
    }
    // @todo test DMA devices ready

    err = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken);
    if (err) {
        LOG_ERR("Could not initialize clock (%d)", err);
        return err;
    }

    /* reset timer to default state using RCC */
    (void)reset_line_toggle_dt(&cfg->reset);

    /* configure pinmux */
    err = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
    if (err < 0) {
        LOG_ERR("PWM pinctrl setup failed (%d)", err);
        return err;
    }

    /* initialize timer */
    LL_TIM_DisableCounter(cfg->timer);
    LL_TIM_StructInit(&init);
    init.Prescaler = 0;
    init.CounterMode = LL_TIM_COUNTERMODE_UP;
    init.Autoreload = DSHOT_TIM_CNTS_PER_BIT;
    init.ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;
    if (LL_TIM_Init(cfg->timer, &init) != SUCCESS) {
        LOG_ERR("Could not initialize timer");
        return -EIO;
    }
    LL_TIM_EnableARRPreload(cfg->timer);
#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    if (cfg->use_burst_dma) {
        LL_TIM_ConfigDMABurst(cfg->timer,
            LL_TIM_DMABURST_BASEADDR_CCR1,
            LL_TIM_DMABURST_LENGTH_4TRANSFERS);
    }
#endif

    err = dshot_set_type(dev, cfg->default_type);
    if (err) {
        LOG_ERR("Could not set Type = DSHOT_%d (%d)", cfg->default_type, err);
        return err;
    }

