eicheltechgames/zflight/drivers/esc/dshot/dshot_stm32.c
    /* configure channels */
    LL_TIM_OC_InitTypeDef *oc_init;
#ifndef CONFIG_DSHOT_BIDIR
    LL_TIM_OC_InitTypeDef oc_init_data;
    oc_init = &oc_init_data;
#else
    /* configure input compare */
    LL_TIM_IC_StructInit(&data->ic_init);
    data->ic_init.ICPolarity = LL_TIM_IC_POLARITY_BOTHEDGE;
    data->ic_init.ICPrescaler = LL_TIM_ICPSC_DIV1;
    data->ic_init.ICFilter = 2;
#endif
    for (int ch_idx = 0; ch_idx < TIMER_MAX_CH; ++ch_idx) {
        const struct dshot_stm32_channel_config *ch_cfg = cfg->channels[ch_idx];
        struct dshot_stm32_channel_data *ch_data = data->channels[ch_idx];

        const uint32_t channel = positive_channel(ch_cfg->ll_channel);

        /* configure output compare */
#ifdef CONFIG_DSHOT_BIDIR
        oc_init = &ch_data->oc_init;
#endif
        LL_TIM_OC_StructInit(oc_init);
        oc_init->OCMode = LL_TIM_OCMODE_PWM1;
        if (is_complementary_channel(ch_cfg->ll_channel)) {
            oc_init->OCNState = LL_TIM_OCSTATE_ENABLE;
        } else {
            oc_init->OCState = LL_TIM_OCSTATE_ENABLE;
        }
        set_mode_oc_init_internal(ch_cfg, DSHOT_MODE_NORMAL, oc_init);
#ifndef CONFIG_DSHOT_BIDIR
        LL_TIM_OC_Init(cfg->timer, channel, oc_init);
        LL_TIM_OC_EnablePreload(cfg->timer, channel);
#endif
        LL_TIM_OC_DisableFast(cfg->timer, channel);

        /* configure dma */
        struct dshot_stm32_dma *dma = &ch_data->dma;
        dma->config.head_block = &dma->block;
        dma->config.user_data = (void *)dev;
        dma->block.source_address = (uint32_t)&ch_data->tim_buf[0]; //@todo uintptr_t?
        dma->block.dest_address = (uint32_t)(&cfg->timer->CCR1 + ch_idx);
        dma->block.block_size = DSHOT_STM32_DMA_TIM_BUF_SIZE;
    }

#ifdef CONFIG_DSHOT_STM32_DMA_BURST
    /* configure dma burst */
    struct dshot_stm32_dma *burst_dma = &data->burst_dma;
    burst_dma->config.head_block = &burst_dma->block;
    burst_dma->config.user_data = (void *)dev;
    burst_dma->block.source_address = (uint32_t)&data->burst_tim_buf[0]; //@todo uintptr_t?
    burst_dma->block.dest_address = (uint32_t)&cfg->timer->DMAR;
    burst_dma->block.block_size = DSHOT_STM32_DMA_BURST_TIM_BUF_SIZE;
#endif

    dshot_stm32_set_direction_output(dev);

    return 0;
}

#define DSHOT_CHANNELS  0, 1, 2, 3
#define GET_DSHOT_CH(N) GET_ARG_N(N, DSHOT_CHANNELS)

#define LL_TIM_CH           LL_TIM_CHANNEL_CH1, LL_TIM_CHANNEL_CH2,\
                            LL_TIM_CHANNEL_CH3, LL_TIM_CHANNEL_CH4
#define GET_LL_TIM_CH(N)    GET_ARG_N(N, LL_TIM_CH)

#define LL_TIM_CHN          LL_TIM_CHANNEL_CH1N, LL_TIM_CHANNEL_CH2N,\
                            LL_TIM_CHANNEL_CH3N, LL_TIM_CHANNEL_CH4N
#define GET_LL_TIM_CHN(N)   GET_ARG_N(N, LL_TIM_CHN)

#define DMA_CH          ch1, ch2, ch3, ch4
#define GET_DMA_CH(N)   GET_ARG_N(N, DMA_CH)

#define TIM(index) DT_INST_PARENT(index)

#define DT_INST_CLK(index, inst)                \
    {                                           \
        .bus = DT_CLOCKS_CELL(TIM(index), bus), \
        .enr = DT_CLOCKS_CELL(TIM(index), bits) \
    }                                           \

#ifdef CONFIG_DSHOT_BIDR
#define DSHOT_DMA_CB_INIT   dshot_stm32_dma_cb

#define DSHOT_DATA_BIDIR    \
    .ic_init = { 0 },       \
    .curr_dir = DIR_OUTPUT, \

#define DSHOT_CH_DATA_BIDIR \
    .oc_init = { 0 },       \

#else
#define DSHOT_DMA_CB_INIT   NULL
#define DSHOT_DATA_BIDIR
#define DSHOT_CH_DATA_BIDIR
#endif

#define DSHOT_DMA_CHANNEL_INIT(index, ch)	                            \
    {                                                                   \
        .dev = DEVICE_DT_GET(STM32_DMA_CTLR(index, ch)),			    \
        .channel = DT_INST_DMAS_CELL_BY_NAME(index, ch, channel),	    \
        .config = {		                                                \
            .dma_slot = STM32_DMA_SLOT(index, ch, slot),                \
            .channel_direction = STM32_DMA_CONFIG_DIRECTION(	        \
                STM32_DMA_CHANNEL_CONFIG(index, ch)),                   \
            .complete_callback_en = IS_ENABLED(CONFIG_DSHOT_BIDR),      \
            .error_callback_dis = !IS_ENABLED(CONFIG_DSHOT_BIDR),       \
            .channel_priority = STM32_DMA_CONFIG_PRIORITY(		        \
                STM32_DMA_CHANNEL_CONFIG(index, ch)),	                \
            .linked_channel = 0,                                        \
            .source_data_size = STM32_DMA_CONFIG_MEMORY_DATA_SIZE(      \
                STM32_DMA_CHANNEL_CONFIG(index, ch)),                   \
            .dest_data_size = STM32_DMA_CONFIG_PERIPHERAL_DATA_SIZE(    \
                STM32_DMA_CHANNEL_CONFIG(index, ch)),                   \
            .block_count = 1,					                        \
            .dma_callback = DSHOT_DMA_CB_INIT,                          \
        },								                                \
        .block = {                                                      \
            .source_addr_adj = STM32_DMA_CONFIG_MEMORY_ADDR_INC(	    \
                STM32_DMA_CHANNEL_CONFIG(index, ch)),	                \
            .dest_addr_adj = STM32_DMA_CONFIG_PERIPHERAL_ADDR_INC(	    \
                STM32_DMA_CHANNEL_CONFIG(index, ch)),	                \
            .source_reload_en  = false,                                 \
            .dest_reload_en = false,                                    \
            .fifo_mode_control = STM32_DMA_FEATURES_FIFO_THRESHOLD(		\
                        STM32_DMA_FEATURES(index, ch)),		            \
        },                                                              \
    }                                                                   \

#ifdef DSHOT_STM32_DMA_BURST
#define DSHOT_DMA_BURST_INIT(index)                                         \
    static __aligned(32) uint32_t                                           \
        dshot_burst_tim_buf_##index##[DSHOT_STM32_DMA_BURST_TIM_BUF_LEN]    \
        = { 0 } __nocache;                                                  \

