eicheltechgames/zflight/drivers/esc/dshot/dshot_stm32.c
#define DSHOT_DATA_DMA_BURST(index)                     \
    .burst_dma = DSHOT_DMA_CHANNEL_INIT(index, UP),     \
    .burst_tim_buf = &dshot_burst_tim_buf_##index[0],   \

#define DSHOT_CONFIG_DMA_BURST(index)                       \
    .use_dma_burst = DT_INST_PROP(index, use_dma_burst),    \

#else
#define DSHOT_DMA_BURST_INIT(index)
#define DSHOT_DATA_DMA_BURST(index)
#define DSHOT_CONFIG_DMA_BURST(index)
#endif

#define DSHOT_CH_REF(node, index, type)                             \
    [GET_DSHOT_CH(DT_PROP(node, channel))] =                        \
        &dshot_stm32_ch_##type##_##index[DT_NODE_CHILD_IDX(node)],  \

#define DSHOT_CH_DATA_INIT(node, index)                                             \
    {                                                                               \
        DSHOT_CH_DATA_BIDIR                                                         \
        .pending_telem_req = false,                                                 \
        .active_cmd = { 0, 0, 0 },                                                  \
        .dma = DSHOT_DMA_CHANNEL_INIT(index, GET_DMA_CH(DT_PROP(node, channel))),   \
        .tim_buf = &dshot_tim_bufs_##index[DT_NODE_CHILD_IDX(node)][0],             \
    },                                                                              \

#define DSHOT_CH_CONFIG_INIT(node)                                                          \
    {                                                                                       \
        .ll_channel = COND_CODE_1(DT_PROP(node, complementary),                             \
            GET_LL_TIM_CHN(DT_PROP(node, channel)), GET_LL_TIM_CH(DT_PROP(node, channel))), \
        .inverted = DT_PROP(node, inverted),                                                \
    },                                                                                      \

#define DSHOT_CH_INIT(index)                                                                \
    static __aligned(32) uint32_t                                                           \
        dshot_tim_bufs_##index[DT_INST_CHILD_NUM_STATUS_OKAY(index)][DSHOT_TIM_BUF_LEN];    \
                                                                                            \
    static struct dshot_stm32_channel_data dshot_stm32_ch_data_##index[] = {                \
        DT_INST_FOREACH_CHILD_STATUS_OKAY_VARGS(index, DSHOT_CH_DATA_INIT, index)           \
    };                                                                                      \
                                                                                            \
    static const struct dshot_stm32_channel_config dshot_stm32_ch_config_##index[] = {      \
        DT_INST_FOREACH_CHILD_STATUS_OKAY(index, DSHOT_CH_CONFIG_INIT)                      \
    };                                                                                      \

#define DSHOT_DEVICE_INIT(index)                                                        \
                                                                                        \
    DSHOT_CH_INIT(index)                                                                \
                                                                                        \
    DSHOT_DMA_BURST_INIT(index)                                                         \
                                                                                        \
    static struct dshot_stm32_data dshot_stm32_data_##index = {                         \
        DSHOT_DATA_BIDIR                                                                \
        .enabled = false,                                                               \
        .last_send_timestamp = 0,                                                       \
        DSHOT_DATA_DMA_BURST(index)                                                     \
        .channels = {                                                                   \
            DT_INST_FOREACH_CHILD_STATUS_OKAY_VARGS(index, DSHOT_CH_REF, index, data)   \
        },                                                                              \
    };								                                                    \
                                                                                        \
    PINCTRL_DT_INST_DEFINE(index);					                                    \
                                                                                        \
    static const struct dshot_stm32_config dshot_stm32_config_##index = {               \
        .timer = (TIM_TypeDef *)DT_REG_ADDR(TIM(index)),	                            \
        .pclken = DT_INST_CLK(index, timer),                                            \
        .reset = RESET_DT_SPEC_GET(TIM(index)),			                                \
        .pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),		                            \
        .default_type = DT_INST_PROP(index, default_type),                              \
        DSHOT_CONFIG_DMA_BURST(index)                                                   \
        .channels = {                                                                   \
            DT_INST_FOREACH_CHILD_STATUS_OKAY_VARGS(index, DSHOT_CH_REF, index, config) \
        },                                                                              \
    };                                                                                  \
                                                                                        \
    DEVICE_DT_INST_DEFINE(index, &dshot_stm32_init, NULL,                               \
                &dshot_stm32_data_##index,                                              \
                &dshot_stm32_config_##index, PRE_KERNEL_2,                              \
                CONFIG_DSHOT_INIT_PRIORITY,                                             \
                &dshot_stm32_driver_api);                                               \

DT_INST_FOREACH_STATUS_OKAY(DSHOT_DEVICE_INIT)